const express = require("express");
const app = express();

const obj = {
  資産の部: {
    流動資産: {
      現金及び預金: [1263910, 1020178],
      受取手形及び売掛金: [1552215, 963490],
      たな卸資産: [36272, 321901],
      その他: [94826, 105985],
      流動資産合計: [2947224, 2411556],
    },
    固定資産: {
      有形固定資産: [305329, 261103],
      無形固定資産: [29569, 571439],
      投資その他の資産: {
        敷金及び保証金: [336130, 336116],
        繰延税金資産: [742106, 712329],
        その他: [243880, 674104],
        投資その他の資産合計: [1322116, 1722551],
        固定資産合計: [1657014, 2555093],
      },
    },
    資産合計: [4604239, 4966650],
  },
  負債の部: {
    流動負債: {
      支払手形及び買掛金: [482958, 310610],
      短期借入金: [0, 17150],
      未払法人税等: [265306, 211115],
      賞与引当金: [112426, 132706],
      その他の引当金: [21413, 17442],
      その他: [621081, 518465],
      流動負債合計: [1503187, 1207491],
    },
    固定負債: {
      資産除去債務: [61866, 61924],
      固定負債合計: [61866, 61924],
    },
    負債合計: [1565053, 1269415],
  },
  純資産の部: {
    株主資本: {
      資本金: [443439, 443749],
      資本剰余金: [727570, 727880],
      利益剰余金: [1872893, 2509148],
      自己株式: [-75272, -75272],
      株主資本合計: [2968629, 3605505],
    },
    非支配株主持分: [70555, 91728],
    純資産合計: [3039185, 3697234],
  },
  負債純資産合計: [4604239, 4966650],
};

app.get("/", (req, res) => {
  res.json(obj);
});
app.post("/", (req, res) => {
  res.json(obj);
});

app.listen(4000, () => {
  console.log(" 4000 でサーバー立ち上げ中....");
});
